Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཀྱིས་རོ་གཅིག་མཁྱེན། །རྣམ་པར་མི་རྟོག་དབྱིངས་ཀྱིས་ནི།
en: Bhagavat, you know the one taste Of that which is pure and impure.

source: །མཆོག་ཏུ་རྣམ་དག་ཐོབ་པར་འགྱུར།
en: Through the concept-free state, You have attained supreme purity. “

source: །བཅོམ་ལྡན་འདས་ནི་མཐའ་མེད་སྐུ།
en: The Bhagavat has an immeasurable body.

source: །ཡི་གེ་འབྲུ་གཅིག་མ་བཤད་ཀྱང་། །སློབ་མ་མང་པོ་རྣམས་དག་ལ། །ཆོས་ཀྱི་ཆར་གྱིས་རྒྱས་པར་མཛད།
en: He does not teach even a single word, Yet a vast rain of Dharma Falls upon his many followers. “

source: །སྐྱེ་བོ་མཚན་མ་སངས་རྒྱས་གཟིགས། །སྣ་ཚོགས་ཐམས་ཅད་ཀུན་ཀྱང་མཁྱེན།
en: The Buddha sees the characteristics of beings; He knows the entirety of their variety.

source: །འོན་ཀྱང་སྡུག་བསྔལ་དེ་དག་ལ། །རྟག་པར་འདྲེན་ཅིང་སྐྱོབ་པར་མཛད།
en: And yet he always saves them And leads them from their suffering. “

source: །སྐྱིད་སྡུག་རྟག་དང་མི་རྟག་དང་། །བདག་ཡོད་བདག་མེད་ལ་སོགས་པ། །གཅིག་དང་ཐ་དད་མ་ཡིན་ཏེ། །མི་སྐྱེ་འགོག་པའང་མ་ཡིན་ནོ།
en: There is no happiness or suffering, No permanence or impermanence, Self or selflessness, and so on, no singleness Or multiplicity, no birth or cessation. “

source: །དེ་ལ་སོགས་པའི་གཞུང་མང་པོ། །བཤད་པའི་ཕྱིར་ནི་རྣམ་པ་ཡོད།
en: He has an outer appearance because He gives these and many other teachings.

source: །དཔེ་རུ་ལུང་སྟོང་བྲག་ཅ་འདྲ།
en: It is like the analogy of an empty valley’s echo.

source: །སངས་རྒྱས་ཉག་གཅིག་མངོན་པར་མཁྱེན།
en: It is solely the Buddha who knows this. “

source: །ཆོས་ཀྱི་དབྱིངས་ལ་བྱེ་བྲག་མེད། །དེ་ཕྱིར་ཐེག་པ་ཐ་དད་མེད། །སྐྱེ་བོ་དག་ནི་བསྒྲལ་བའི་ཕྱིར། །བསྟན་པ་རྣམ་པ་གསུམ་ཡང་ཡོད།
en: The Dharma realm has no specifics, And so there are no different yānas, But in order to liberate beings, There are the three kinds of teaching.”

source: །དེ་ནས་ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་འདུག་པའི་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བྱས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་གུས་པར་སངས་རྒྱས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་སངས་རྒྱས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་དཀོན་ཞིང་དཔག་ཏུ་མེད་པ་འདི་ཐོག་མ་དང་བར་མ་དང་ཐ་མར་དགེ་གཞུང་དང་ཚིག་འབྲུ་བཟང་པོ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་གྲུབ་པར་ནུས་པ་འདི་འཛིན་ཅིང་འཆང་བའི་མི་ནི་སངས་རྒྱས་ཐམས་ཅད་ལ་ལན་གློན་པ་ཞེས་བགྱིའོ།
en: Then the great Brahmarāja rose from his seat and, with his upper robe over one shoulder, knelt on his right knee, placed his palms together, reverently bowed down to the Bhagavat’s feet, and said to the Bhagavat, “Bhagavat, this Supremely Victorious King of Sūtras, the Sublime Golden Light is rare and beyond evaluation; it is good in the beginning, good in the middle, and good in the end; it has a good meaning; it has good words; it can accomplish all the Dharmas of the Buddha.

source: །སངས་རྒྱས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: A human who possesses and holds it is someone who repays all the buddhas.” “

source: །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Noble one, it is so, it is so.

source: དེ་དེ་བཞིན་ནོ། །ཁྱེད་ཀྱིས་སྨྲས་པ་བཞིན་ཏེ།
en: It is as you have said,” replied the Bhagavat. “

source: རིགས་ཀྱི་བུ་མདོ་སྡེ་འདི་མཉན་ཅིང་ཐོས་པ་ནི་ཀུན་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་གོ།
en: Noble one, all who listen to and hear this sūtra will progress irreversibly to the highest, most complete enlightenment. “

source: རིགས་ཀྱི་བུ་མདོ་སྡེ་འདིས་ནི་ཕྱིར་མི་ལྡོག་པའི་སའི་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་གི་དགེ་བའི་རྩ་བ་སྨིན་ཅིང་གྲུབ་པར་ནུས་སོ།
en: Noble one, it can ripen the supreme good roots of the bodhisattvas who are irreversibly upon the bhūmis.

source: །འདི་ནི་མཆོག་གི་ཆོས་ཀྱི་ཕྱག་རྒྱའོ། །འདི་ནི་མདོ་སྡེ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་སྟེ།
en: It is the seal of the supreme Dharma, and it is the king of all sūtras.

source: མཉན་ཅིང་ཐོས་པ་དང་། འཆང་ཞིང་འཛིན་པ་དང་། ཀློག་ཅིང་འདོན་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Therefore, listen to it and hear it; possess it and hold it; read it and recite it. “

source: རིགས་ཀྱི་བུ་སྐྱེ་བོ་རྣམས་དགེ་བའི་རྩ་བ་མ་སྐྱེད་པ། དགེ་བའི་རྩ་བ་མ་སྨིན་པ། སངས་རྒྱས་རྣམས་ལ་མ་བསྙེན་པས་ནི་མཆོག་གི་མདོ་སྡེ་འདི་མཉན་ཅིང་ཐོས་པར་མི་ནུས་སོ། །རིགས་ཀྱི་བུའམ།
en: Noble one, beings who have not planted good roots, who have not ripened their good roots, and who have not served the buddhas will not be able to hear this sublime Dharma. “

source: རིགས་ཀྱི་བུ་མོ་ལ་ལས་ཉན་ཅིང་འཆང་ན་སྡིག་པ་མི་དགེ་བའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་བྱང་ཞིང་ཟད་ནས་མཆོག་ཏུ་རྣམ་པར་དག་ཅིང་རྟག་པར་སངས་རྒྱས་མཐོང་ནས་སངས་རྒྱས་རྣམས་དང་། དགེ་བའི་བཤེས་གཉེན་མཆོག་ཏུ་སྤྱོད་པའི་མིང་དང་མི་འབྲལ་ཞིང་རྟག་པར་དམ་པའི་ཆོས་ཐོས་ནས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པ་དང་། མཆོག་གི་གཟུངས་ཀྱི་སྒོ་མི་ཟད་མི་འགྲིབ་པར་ཐོབ་པར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ། རྒྱ་མཚོའི་ཕྱག་རྒྱ་མཆོག་གི་ཡོན་ཏན་འབྱུང་བའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དང་། སྤྱོད་པ་དང་།
en: Those noble men or noble women who hear and possess it will be purified of all their karmic obscurations, which will cease, and they will be supremely pure, always see the buddhas, and never be apart from what are termed the supreme practices of the buddhas and kalyāṇamitras.

source: ཚིག་ལ་ཐོགས་པ་མེད་པའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། ཉི་མའི་དཀྱིལ་འཁོར་དྲི་མ་མེད་པ་མཚན་ཉིད་ཀྱི་འོད་ཀྱི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། ཟླ་བ་རྒྱས་པའི་མཚན་ཉིད་འོད་ཀྱི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། སླད་པ་ཐམས་ཅད་ཐུལ་ནས་ཡོན་ཏན་འཕེལ་བའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། རྡོ་རྗེའི་རི་བསྙིལ་བའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། བཤད་དུ་མི་རུང་བ་རྒྱུ་རྐྱེན་གྱི་སྙིང་པོ་བཤད་མི་ནུས་པ་འཆང་བའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་།
en: They will attain the unceasing, unobscured gateway of supreme dhāraṇīs, which are like this: the unceasing, unobscured dhāraṇī of the arising of the supreme qualities of the seal of the ocean; the unceasing, unobscured dhāraṇī that is unimpeded in the minds, types of conduct, and languages of all beings; the unceasing, unobscured dhāraṇī of the light of the characteristics of the stainless disk of the sun; the unceasing, unobscured dhāraṇī of the light of the characteristics of the full moon; the unceasing, unobscured dhāraṇī that defeats corruption and increases good qualities; the unceasing, unobscured dhāraṇī that demolishes vajra mountains; the unceasing, unobscured dhāraṇī that holds what cannot be taught, the essence of the causes and conditions that it is not appropriate to teach; the unceasing, unobscured dhāraṇī of the unimpeded voice for the Dharma that tells the truth; the unceasing, unobscured dhāraṇī of the seal of the mind and virtuous conduct of stainless space; and the unceasing, unobscured dhāraṇī of the directly perceived appearances of all the bodies of endless buddhas, and so on. “

source: བདེན་པར་སྨྲ་བའི་ཆོས་ལ་ཐོགས་པ་མེད་པའི་སྒྲའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། ནམ་མཁའ་དྲི་མ་མེད་པའི་སེམས་དང་། སྤྱོད་པའི་ཕྱག་རྒྱའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། མཐའ་མེད་པའི་སངས་རྒྱས་ཀྱི་སྐུ་ཐམས་ཅད་མངོན་དུ་སྣང་བའི་གཟུངས་མི་ཟད་མི་འགྲིབ་པ་དང་། རིགས་ཀྱི་བུ་འདི་ལ་སོགས་ཏེ་མི་ཟད་མི་འགྲིབ་པའི་གཟུངས་ཐམས་ཅད་ཀྱི་ཚད་ཀྱི་སྒོ་གྲུབ་ཅིང་ཐོབ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་སྐུར་སྤྲུལ་ནས་བླ་ན་མེད་པ་དམ་པའི་ཆོས་འཆད་དོ།
en: Noble one, the bodhisattvas mahāsattvas will emanate as the bodies of buddhas in all buddha realms in the ten directions and teach the highest sublime Dharma in order that the extent of all gateways to these unceasing, unobscured dhāraṇīs will be accomplished and attained.

source: །ཆོས་ཀྱི་དེ་བཞིན་ཉིད་ནི་མི་གཡོ་མི་གནས་མི་འགྲོ་མི་འོང་བའི་ཕྱིར་རོ།
en: This is because the true nature of phenomena does not move, does not stay, does not go, and does not come.

source: །སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་གྲུབ་ཅིང་སྨིན་པར་བྱས་ཀྱང་སྐྱེ་བོ་གཅིག་སྨིན་པར་ཡང་མི་མཐོང་ངོ་།
en: Even though they accomplish and ripen the good roots of beings, they do not see a single being becoming ripened.

source: །ཆོས་སྣ་ཚོགས་འཆད་མོད་ཀྱི་ཚིག་འབྲུ་ལ་མི་གཡོ་མི་གནས་མི་འགྲོ་མི་འོང་ངོ་།
en: Even though they teach various kinds of Dharmas, even in words they do not move, stay, go, or come.

source: །སྐྱེ་ཞིང་འགོག་པ་སྟོན་ཀྱང་སྐྱེ་ཤིང་འགོག་པ་མེད་པར་ཁོང་དུ་ཆུད་དོ།
en: Even though they teach production and cessation, they comprehend that there is no production or cessation.

source: །ཅིའི་རྒྱུས་ན་འདུ་བྱེད་ཀྱི་ཆོས་རྣམས་ལ་འགྲོ་བ་དང་འོང་བ་མེད་ཅེ་ན།
en: Why is there no coming or going in phenomena?

source: ཆོས་སོ་ཅོག་གི་ངོ་བོ་ཉིད་ཐ་དད་པ་མེད་པའི་ཕྱིར་རོ།
en: It is because there is no difference in the nature of any phenomena.”

source: །ཆོས་འདི་འཆད་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབུམ་ཕྲག་སུམ་ཁྲི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །དཔག་ཏུ་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ཕྱིར་མི་ནུར་བ་ཐོབ་བོ། །དཔག་ཏུ་མེད་མཐའ་མེད་པའི་དགེ་སློང་དང་དགེ་སློང་མ་ཆོས་ལ་ཆོས་ཀྱི་མིག་གཙང་མ་ཐོབ་བོ། །དཔག་ཏུ་མེད་པའི་སྐྱེ་བོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When this Dharma teaching was given, three thousand million bodhisattvas attained patience of the quality of birthlessness; innumerable bodhisattvas attained the irreversible enlightenment mind; innumerable, endless bhikṣus and bhikṣunīs attained the pure Dharma eyes regarding phenomena; and innumerable beings developed the enlightenment mind.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་གསུངས་སོ། །རྒྱལ་པོའི་ཆོས་ཀྱིས་འཁོར་ཀུན་བཟློག །
en: Then, at that time, the Bhagavat spoke this verse: “The Dharma of the jinas repels saṃsāra.

source: ཟབ་ཅིང་ཡངས་མཆོག་མཐོང་བར་དཀའ།
en: It is profound, vast, supreme, and difficult to see.

source: །སྐྱེ་བོ་དམུས་ལོང་འདོད་པས་ཁེབས། །མི་མཐོང་ཕྱིར་ནི་སྡུག་བསྔལ་ལེན།
en: Those who are blind, obscured by desire, Do not see it and therefore acquire suffering.”

source: །དེ་ནས་ཕལ་མང་པོ་ལྷན་ཅིག་ཏུ་འདུག་པ་ལངས་ཏེ་སངས་རྒྱས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་སངས་རྒྱས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གནས་གང་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་འཆང་བ་དང་། ཀློག་ཅིང་ཁ་ཏོན་དུ་བགྱིད་པ་དེར་བདག་ཅག་ལ་སོགས་པ་ཕལ་མང་པོ་རྣམས་ཐམས་ཅད་དེར་མཆིས་ཏེ་ཉན་པའི་འཁོར་བགྱིའོ།
en: That great multitude then rose up together from their seats, bowed their heads to the Buddha’s feet, and said to the Buddha, “Bhagavat, wherever someone teaches, reads, and recites this Supremely Victorious King of Sūtras, the Sublime Golden Light, we and the rest of this multitude will go there and be the assembly that listens.

source: །ཆོས་འཆད་པའི་མཁན་པོ་དེ་ལ་ཕན་པ་དང་། བདེ་ཞིང་སྐྱིད་པ་དང་། བསྒྲིབས་པ་མེད་པ་དང་། ལུས་དང་ཡིད་བག་ཡངས་སུ་བགྱིའོ།
en: We will benefit that preceptor who teaches the Dharma, and make him blissful and happy, free of obscurations, and relaxed in body and mind.

source: །བདག་ཅག་ལ་སོགས་པས་སེམས་ཐག་པ་ནས་མཆོད་ཅིང་ཡང་ཕལ་མང་པོ་ཉན་པ་དེ་དག་བདེ་ཞིང་སྐྱིད་པར་བགྱིའོ།
en: We and the others will sincerely make offerings to him and make the multitudes who listen happy. “

source: །ག་ལ་གནས་པའི་ཡུལ་དེ་ན་དགྲ་དང་། འཇིགས་ཤིང་སྐྲག་པ་དང་། གནོད་པ་དང་། མུ་གེ་དང་། ཉོན་མོངས་པ་མ་མཆིས་པར་བགྱིའོ།
en: We will make that land have no enemies, terror, fear, harm, famine, or tribulations.

source: །ཡུལ་གྱི་མི་དར་ཞིང་རྒྱས་པར་བགྱིའོ།
en: We will cause the people of that land to multiply and spread.

source: །ཆོས་འདི་བཤད་པའི་གནས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་དེར་ལྷ་དང་། མི་མ་ཡིན་པ་དང་། སྐྱེ་བོ་རྣམས་ཀྱིས་མི་རྫི། མི་འཆག །མི་གཙང་བ་ལ་སོགས་པས་མི་བསྒོའོ།
en: We will not allow devas, nonhumans, or other beings to trample, walk, make dirty, and so on, the area that is the location of that Dharma teaching.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: ཆོས་འཆད་པའི་གནས་དེ་མཆོད་རྟེན་ཉིད་ལགས་པས་ན་བདུག་པ་དང་། མེ་ཏོག་དང་བ་དན་དང་། གདུགས་ཀྱིས་མཆོད་པར་བགྱིའོ།
en: Because that place where the Dharma is taught is a shrine, and so we will offer incense, flowers, flags, and parasols to it.

source: །བདག་ཅག་ལ་སོགས་པས་རྟག་པར་བསྲུངས་ནས་རྒུད་ཅིང་དམས་པ་ལས་བྲལ་བར་བགྱིའོ།
en: We and others will always protect it and keep it free from deterioration and decay.”

source: །སངས་རྒྱས་ཀྱིས་ཕལ་མང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱེད་ལ་སོགས་པས་མདོ་སྡེ་མཆོག་འདི་ལ་བརྩོན་པར་བསྒོམས་ན་དེ་ནི་དམ་པའི་ཆོས་འཇིག་རྟེན་ན་ཡུན་དུ་བཞུགས་པ་ཞེས་བྱའོ།
en: Then the Bhagavat said to that multitude, “Noble ones, if you and others should meditate diligently on this supreme sūtra, then this sublime Dharma will remain for a long time in this world.”

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བའི་མདོ་སྡེའི་རྒྱལ་པོ་ལས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་གཟུངས་ཀྱི་ལེའུ་སྟེ་དྲུག་པའོ།། །།གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ། བམ་པོ་ལྔ་པ།
en: This concludes “The Dhāraṇīs of Complete Purification,” the sixth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་སངས་རྒྱས་ཀྱིས་བྱང་ཆུབ་ཤིང་གི་ལྷ་དགེ་བའི་ལྷ་མོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ད་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས་ཤིག །བཟང་པོ་དཔལ་བྱང་ཆུབ་སེམས་དཔའི་མཚན་མོའི་རྨི་ལམ་དུ་གསེར་གྱི་རྔ་ལས་སྒྲ་ཆེན་པོ་བྱུང་སྟེ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསྟོད་པ་དང་། འགྱོད་ཚངས་ཀྱི་ཆོས་མཐོང་བ་དེའི་རྒྱུ་ཁྱེད་ལ་སོགས་པ་ལ་རྒྱ་ཆེར་བཤད་པ་འདི་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Chapter 7: A Praise Using the Analogy of a Lotus Then the Bhagavat said to the virtuous goddess who is the goddess of the Bodhi tree, “Now know this, Goddess Śrī, you should listen well and remember this praise of the buddhas and purification through regret that came as a loud sound from a golden drum that was seen in the bodhisattva’s dream at night. “

source: འདས་པའི་ཚེ་རྒྱལ་པོ་གསེར་ཀླུའི་དབང་པོ་ཞེས་བྱ་བས་རྟག་པར་པདྨོ་ཀ་མ་ལ་ལྟ་བུས་ཕྱོགས་བཅུ་དུས་གསུམ་གྱི་སངས་རྒྱས་རྣམས་ལ་བསྟོད་ཅིང་བསྔགས་སོ།
en: In the past, there was a king by the name of Lord of Golden Nāgas, who always praised and extolled the buddhas in the ten directions and three times as being like a red lotus.”

source: །དེ་ནས་ཕལ་མང་པོ་ལ་བསྟོད་པའི་ཚིགས་སུ་བཅད་པ་འདི་གསུངས་སོ། །གང་རྒྱལ་སྔ་མ་གང་དག་བྱུང་བ་དང་། །ཕྱོགས་བཅུ་དག་ན་གང་དག་བཞུགས་པ་དང་། །རྒྱལ་བ་དེ་དག་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །རྒྱལ་བ་དེ་དག་ཀུན་ལ་བདག་བསྟོད་དོ།
en: He then recited these verses of praise to the multitude: “ ‘Those jinas who have appeared in the past, And the jinas present in the ten directions, I pay homage to all those jinas And I praise all those jinas. “ ‘

source: །ཐུབ་དབང་ཞི་བ་རབ་ཞི་རྣམ་པར་དག །
en: A lord of munis is peaceful, totally peaceful, and pure.

source: ཁ་དོག་གསེར་དང་འདྲ་བར་སྣང་བའི་སྐུ། །སངས་རྒྱས་དབྱངས་ནི་དབྱངས་ཀུན་ནང་ན་སྙན། །ཚངས་པའི་སྒྲ་སྐད་ཤིན་ཏུ་བསྒྲགས་པའི་གསུང་།
en: His body shines with a golden color. A buddha’s voice is the most melodious of all voices, Speech that resounds like the voice of Brahmā. “ ‘

source: །རྐང་དྲུག་རྨ་བྱ་སྣག་ཚ་འདྲ་བའི་དབུ། །སྔོན་པོ་རབ་བསྐུམས་བྱ་དང་འདྲ་བར་མཛེས།
en: He has hair like a bee, a peacock, and ink, With blue curls, like the blue jaybird.

source: །དུང་དང་ཁ་བ་ལྟ་བུར་དཀར་བའི་ཚེམས། །གསེར་གྱིས་སྤྲས་པ་ལྟ་བུར་རྟག་ཏུ་སྣང་།
en: His teeth are as white as snow or a conch And always shining as if adorned by gold. “ ‘

source: །སྡོ་ཞིང་ཡངས་ལ་ཤིན་ཏུ་དྲི་མེད་སྤྱན། །མེ་ཏོག་ཨུཏྤལ་སྔོན་པོ་ཁ་འབུས་འདྲ།
en: His eyes are blue, wide, and perfectly stainless; They are like blue lotuses in blossom.

source: །ལྗགས་ཀྱི་ཁ་དོག་བཟང་ཡངས་པདྨ་འདྲ། །པདྨ་སྐྱེས་པར་སྣང་བའི་པདྨོ་འདྲ།
en: His broad, excellent tongue is the color of a red lotus— It is like a lotus, a shining lotus blossom. “ ‘

source: །སྨིན་མཚམས་དུང་དང་པདྨའི་རྩ་བ་འདྲ།
en: Between the eyebrows, the ūrṇā hair is the color of a conch or lotus root.

source: །གཡས་ཕྱོགས་འཁྱིལ་པ་ཁ་དོག་བཻ་ཌཱུརྱ།
en: It curls to the right and is the color of a white beryl.

source: །ཟླ་བ་ཚེས་ཤིང་ཟླ་བ་ཕྲ་བ་འདྲ།
en: It is like a crescent moon, a sliver of the moon.

source: །ཐུབ་པ་མགོན་སྐུ་འབར་བ་བུང་བ་འདྲ།
en: The protector Muni’s body shines like a carpenter bee. “ ‘

source: །འཇམ་བཟངས་གསེར་གྱི་ཐུར་མ་འདྲ་བ་ཡི། །ཞལ་ལས་འཕགས་ཞིང་ལྷམ་མེར་གྱུར་པའི་ཤངས། །རབ་མཆོག་དམ་པ་འཕགས་པ་རི་ཡི་མཆོག །རྒྱལ་བ་ཀུན་གྱི་རྟག་ཏུ་འཇམ་པའོ།
en: His face has a bright and prominent nose That is smooth, excellent, and like a golden staff— A perfect, sublime, noble, supreme nose, The always smooth nose of all the jinas. “ ‘

source: །བ་སྤུའི་ཁུང་ནས་རེ་རེ་འབྱུང་བ་སྟེ། །སྤུ་བྱུང་བ་ནི་གཡས་ཕྱོགས་སུ་འཁྱིལ་བ། །སྔོན་པོ་ཟླུམ་པོ་ལྟ་བུར་སྐྱེས་པའོ། །སྔོན་པོ་བརྒྱན་པ་རྨ་བྱའི་མགུལ་ལྟར་མཛེས།
en: From each and every pore there Rises a hair that curls to the right, Growing as a dark blue curl, Blue and adorning, like a peacock’s neck. “ ‘

source: །སྐྱེས་མ་ཐག་ཏུ་རབ་ཏུ་སྣང་བའི་སྐུ། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཐམས་ཅད་གང་བར་འགྱུར། །འཇིག་རྟེན་གསུམ་ན་སྡུག་བསྔལ་ཐམས་ཅད་ཞི། །བདེ་བ་ཀུན་གྱིས་སེམས་ཅན་ངོམས་པར་མཛད།
en: As soon as he was born, his body shone, Filling all worlds in the ten directions with light, Ending the endless sufferings in the three worlds, And satisfying beings with every happiness. “ ‘

source: །སེམས་ཅན་དམྱལ་དང་བྱོལ་སོང་འགྲོ་བ་དང་། །ཡི་དགས་ལྷ་གནས་མི་ཡི་འགྲོ་བ་དང་། །སེམས་ཅན་བདེ་བ་ཀུན་གྱིས་ཚོགས་པར་མཛད། །ངན་སོང་འགྲོ་བ་ཐམས་ཅད་རབ་ཞི་མཛད།
en: He created an accumulation of all happiness For the beings in the hells, the animals, The pretas, devas, and human beings, And brought to an end all lower existences. “ ‘

source: །ཁ་དོག་བཟང་པོ་གསེར་དང་འདྲ་བའི་མཛེས། །ཤིན་ཏུ་སྦྱངས་པའི་གསེར་དང་འདྲ་བའི་སྐུ།
en: His excellent color is beautiful like gold; His body resembles purified gold.

source: །བདེ་གཤེགས་ཞལ་ནི་དྲི་མེད་ཟླ་བ་འདྲ། །མཛེས་པར་གྱུར་ཅིང་ཤིན་ཏུ་དྲི་མེད་ཞལ།
en: The Sugata’s face is like a stainless moon; It is a beautiful and stainless face. “ ‘

source: །ཡན་ལག་གཞོན་པར་གྱུར་ཅིང་འཇམ་པའི་སྐུ།
en: His smooth body has limbs that are like a youth’s.

source: །འགྲོ་ཞིང་གནོན་པའི་སེང་གེའི་མཆོག་དང་འདྲ།
en: He walks and strides like a supreme lion.

source: །ཕྱག་ཕྱང་དབང་བ་རབ་ཏུ་འཕྱང་བར་གྱུར། །རླུང་གིས་སཱ་ལའི་ལྕུག་མ་བསྐྱོད་པ་བཞིན།
en: His powerful arms hang down very long Like vines on a sāl tree moved by the breeze. “ ‘

source: །འདོམ་གང་འཁོར་བར་འབར་བའི་འོད་ཟེར་གཏོང་། །ཉི་མ་སྟོང་དང་འདྲ་བར་ཤིན་ཏུ་ལྷན།
en: He shines light rays as a fathom-wide aura; He is as bright as a thousand suns.

source: །ཐུབ་པའི་དབང་པོ་དྲི་མ་མེད་པའི་སྐུ། །ཐམས་ཅད་མཐའ་ཡས་ཞིང་ཀུན་སྣང་བར་གྱུར།
en: The stainless body of the lord of Munis Illuminates all of the infinite realms.“ ‘

source: །ཟླ་བ་ལྟ་བུར་སྣང་བྱེད་འདྲ་བར་གྱུར། །ཞིང་རྣམས་མཐའ་ཡས་བརྒྱ་ཕྲག་སྟོང་ཀུན་ཏུ།
en: He is shining with light, like the moon In endless hundreds of thousands of realms.

source: །དེ་དག་འོད་ནི་ཐམས་ཅད་མེད་པར་གྱུར། །སངས་རྒྱས་ལྷམ་མེར་སྣང་བར་གྱུར་པའི་ཕྱིར།
en: All of their lights cease to be because They are brightly illuminated by the Buddha. “ ‘

source: །སངས་རྒྱས་ཉིད་བྱེད་འཇིག་རྟེན་སྒྲོན་མར་གྱུར།
en: The sun of the Buddha is the lamp of the world.

source: །སངས་རྒྱས་ཉིན་མོ་ཉི་མ་བརྒྱ་སྟོང་གིས། །བརྒྱ་ཕྲག་སྟོང་གི་ཞིང་རྣམས་ཀུན་ཏུ་ཡང་། །དེ་བཞིན་གཤེགས་པའི་ཉི་མ་སེམས་ཅན་མཐོང་།
en: The Buddha’s sun is like a hundred thousand suns, And within hundreds of thousands of realms Beings can see the sun of the Tathāgata. “ ‘

source: །བསོད་ནམས་བརྒྱ་ཕྲག་སྟོང་གིས་བསྒྲུབས་པའི་སྐུ།
en: His body is formed from a hundred thousand merits.

source: །ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་ནི་བརྒྱན་པའི་སྐུ།
en: His body is adorned by all good qualities.

source: །རྒྱལ་ཕྱག་བལ་གླང་རྒྱལ་པོའི་སྣ་དང་འདྲ།
en: The Jina’s arms are like the trunk of an elephant king.

source: །རབ་འབར་ཤིན་ཏུ་དྲི་མེད་རྐང་ལག་མཆོག །ས་ཡི་སྟེང་གི་རྡུལ་དང་མཉམ་པ་དང་། །སངས་རྒྱས་གང་འདས་རྡུལ་ཕྲན་མཉམ་པ་དང་། །གང་དག་འབྱུང་བ་རྡུལ་ཕྲན་མཉམ་པ་དང་།
en: His supreme hands and feet are stainless and shining. “ ‘

source: །གང་དག་བཞུགས་པ་རྡུལ་ཕྲན་མཉམ་པ་དང་། །རྒྱལ་བ་དེ་དག་རྣམས་ལ་ཕྱག་འཚལ་བ། །ལུས་དང་ངག་དང་ཡིད་ནི་དང་བས་སོ། །མེ་ཏོག་རབ་ཏུ་སྦྱིན་དང་དྲི་རབ་སྦྱིན། །ཁ་དོག་བརྒྱ་ཡང་ཤིན་ཏུ་སེམས་བཟང་གིས།
en: The buddhas who have been are as numerous as particles, As numerous as the dust on the surface of the earth; Those who will appear, who are as numerous as the smallest particles, And those who are present, who are as numerous as the smallest particles, “ ‘To those jinas I pay homage In pure faith, with body and speech, Offering flowers and offering perfumes With a hundred colors and a virtuous mind. “ ‘

source: །བདག་གི་ལྕེ་བརྒྱས་སངས་རྒྱས་ཡོན་ཏན་རྣམས། །བསྐལ་པ་སྟོང་དུ་བརྗོད་པར་མི་ནུས་སོ།
en: I could not describe those qualities of the jinas In a thousand eons with a hundred tongues.

source: །རྒྱལ་བ་དག་གི་དགེ་བ་གང་རྫོགས་པ། །སྙིང་པོ་མཆོག་རབ་སྣ་ཚོགས་དུ་མ་དག །
en: The virtues that the jinas have perfected Are a numerous variety of supreme essences. “ ‘

source: རྒྱལ་བ་གཅིག་གི་ཡོན་ཏན་བརྗོད་མི་ནུས། །ལྕེ་སྟོང་གིས་ཀྱང་ཆུང་ཟད་བཤད་པར་ནི། །རྒྱལ་བ་ཀུན་གྱི་ནུས་པ་ཅི་ཞིག་སྨོན།
en: With a thousand tongues I could not describe Even a little of the qualities of a single jina, Let alone the qualities of all the jinas.

source: །ཡོན་ཏན་གཅིག་ལ་རྒྱ་ཆེར་བཤད་པ་ཡང་།
en: For just a single quality there would be a vast teaching. “ ‘

source: །ལྷ་དང་འཇིག་རྟེན་ཐམས་ཅད་རྒྱ་མཚོར་གྱུར། །སྲིད་པའི་ཐོག་མ་མན་ཆད་ཀུན་ཆུ་གང་། །ཚད་གཟུང་བར་ནི་བ་སྤུའི་རྩེ་མོས་ནུས། །བདེ་བར་གཤེགས་པའི་ཡོན་ཏན་གཅིག་མི་ནུས།
en: If the world and its paradises became an ocean And up to the summit of existence became filled with water, It would be possible to measure that with the tip of a hair, But one could not measure a single quality of the sugatas. “ ‘

source: །བཤད་པ་མཆོད་པ་བསྟོད་པ་ཐམས་ཅད་ཀྱང་། །ལུས་དང་ངག་ཡིད་དག་ནི་དང་བ་སྟེ། །བདག་གིས་བསོད་ནམས་འབྲས་བུ་མཆོག་གང་བསགས། །དེ་ཡིས་སེམས་ཅན་རྒྱལ་བ་ཐོབ་པར་ཤོག །རྒྱལ་པོས་སངས་རྒྱས་དེ་ལྟར་བསྟོད་ནས་སུ།
en: Whatever supreme results of merit I have accumulated Through all my teaching, praises, and offerings With faith, and with my body, speech, and mind, Through that may beings attain buddhahood.’ “

source: །རྒྱལ་པོ་སྨོན་ལམ་འདི་ལྟར་འདེབས་པར་བྱེད། །ག་ལ་ག་ལར་བདག་སྐྱེས་གྱུར་པ་ན། །མ་འོངས་པ་ཡི་བསྐལ་པ་མཐའ་མེད་པར། །རྔ་འདི་འདྲ་བའི་རྨི་ལམ་མཐོང་བར་ཤོག །བཤགས་པ་འདི་འདྲ་དེར་ནི་ཐོས་པར་ཤོག །རྒྱལ་བསྟོད་པདྨའི་འབྱུང་གནས་འདི་དང་འདྲ།
en: The king thus praised the Buddha, And then the king made this prayer: ‘Wherever I am reborn, Throughout endless future eons, “ ‘May I see a dream of such a drum, May I there hear this kind of confession, And may I obtain in those hundreds of lifetimes A praise of the jinas like this Source of Lotuses. “ ‘

source: །སྐྱེ་བ་བརྒྱར་ཡང་དེ་ན་ཐོབ་པར་ཤོག །སངས་རྒྱས་ཡོན་ཏན་མཐའ་ཡས་མཉམ་པ་མེད། །གང་དེ་བསྐལ་པ་སྟོང་དུ་དཀོན་པ་སྟེ། །དེ་དག་རྨི་ལམ་དུ་ཡང་ཐོས་པར་ཤོག །དེ་དག་ཉིན་མོར་གྱུར་ན་བཤད་པར་བྱ།
en: May I hear in a dream those Infinite, unequaled qualities of the buddhas, Which are rare even in a thousand eons, And then teach them in the day. “ ‘

source: །སྡུག་བསྔལ་རྒྱ་མཚོ་ལས་ནི་སེམས་ཅན་དགྲོལ།
en: May I free beings from the ocean of suffering.

source: །ཕ་རོལ་ཕྱིན་པ་དྲུག་ནི་རྫོགས་པར་བྱ། །བྱང་ཆུབ་བླ་མེད་ཕྱི་ནས་ཐོབ་པར་ཤོག །དགྲ་མེད་ཞིང་ནི་བདག་གིས་ཐོབ་པར་ཤོག །
en: May I complete the six perfections And afterward attain the highest enlightenment, And may I attain a realm without equal. “ ‘

source: རྔ་རབ་བྱིན་པའི་རྣམ་སྨིན་འབྲས་བུ་དང་། །རྒྱལ་བ་ཐམས་ཅད་བསྟོད་པའི་རྒྱུ་ཡི་ཕྱིར། །ཤཱཀྱ་ཐུབ་པའི་དབང་པོ་མངོན་མཐོང་ཤོག །བདག་གིས་ལུང་བསྟན་པ་ཡང་དེར་ཐོབ་ཤོག །
en: Through the ripened result of offering a drum, And through the cause that is praising the jinas, May I directly see the Śākya lord of munis, And may I attain there the prophecy of my buddhahood. “ ‘

source: གང་འདི་བདག་གི་བུ་ཕོ་གཉིས་པོ་དག །གསེར་གྱི་དཔུང་པའི་དབང་དང་གསེར་གྱི་འོད། །ཁྱེའུ་འདི་གཉིས་ཀྱང་དེ་ནས་ཐོབ་པར་ཤོག །བྱང་ཆུབ་བླ་ན་མེད་པའི་ལུང་བསྟན་ཀྱང་།
en: May these who are my two sons— Kanakabhujendra and Kanakaprabhāsvara— May these two youths also attain there The prophecy of their highest enlightenment. “ ‘

source: །སེམས་ཅན་གང་དག་སྐྱབས་དང་དཔུང་གཉེན་མེད། །མགོན་མེད་སྡུག་བསྔལ་སོང་བར་གྱུར་པ་དག །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་དེ་དག་ལ། །མགོན་དང་སྐྱབས་དང་དཔུང་གཉེན་གྱུར་པར་ཤོག །
en: May those beings who have no savior or defender, Who are without a protector and are suffering, Throughout all future eons Have saviors, defenders, and protectors. “ ‘

source: སྡུག་བསྔལ་འབྱུང་བ་ཟད་པར་བྱེད་པ་དང་། །བདེ་བ་ཀུན་གྱི་འབྱུང་གནས་གྱུར་པར་ཤོག །
en: May the sources of all suffering come to an end, And may there be the sources of all happiness.

source: མ་འོངས་བསྐལ་པར་བྱང་ཆུབ་སྤྱད་པ་ནི། །དེ་དག་ཇི་ཙམ་ཐོག་མའི་མཐའ་ཡོད་པར།
en: May I have the conduct of enlightenment in future eons, Which are as numerous as the eons of the past. “ ‘

source: །གསེར་འོད་དམ་པར་བཤགས་པ་བྱས་པས་ན། །བདག་གི་སྡིག་པའི་རྒྱ་མཚོ་སྐེམས་པར་ཤོག །བདག་གི་རྒྱ་མཚོ་ལས་ནི་བྱང་བར་ཤོག །
en: Through The Sublime Golden Light confession, May my ocean of bad actions dry up, May I be purified of my ocean of karma, [And may my ocean of kleśas cease to exist.] “ ‘

source: བདག་གི་བསོད་ནམས་རྒྱ་མཚོ་རྫོགས་པར་ཤོག །
en: May my ocean of merit become complete.

source: བདག་གི་ཡེ་ཤེས་རྒྱ་མཚོ་རྣམ་དག་ཤོག །
en: May my ocean of wisdom be pure.
